windsinger99/wmc-ctsi-0850-fe-be-app/board/pin_mux.h
/*
 * Copyright 2018 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#if (MODEL_SPT == MODEL_CTSK_N650_V100)
#if 1
#define BOARD_INITPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0xCF30C000U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */
#define BOARD_INITPINS_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0x45FF000EU /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */

/* GPIO_B1_13 (coord D14), WDOG_B */
/* Routed pin properties */
#define BOARD_INITPINS_WDOG_B_PERIPHERAL                                   WDOG1   /*!< Peripheral name */
#define BOARD_INITPINS_WDOG_B_SIGNAL                                      wdog_b   /*!< Signal name */

/* GPIO_AD_B1_06 (coord J12), [J12] GPIO_AD_B1_06_ADC1 */
/* Routed pin properties */
#define BOARD_INITPINS_ADC1_PERIPHERAL                                      ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_ADC1_SIGNAL                                            IN   /*!< Signal name */
#define BOARD_INITPINS_ADC1_CHANNEL                                          11U   /*!< Signal channel */

/* GPIO_AD_B1_07 (coord K10), [K10] GPIO_AD_B1_07_ADC2 */
/* Routed pin properties */
#define BOARD_INITPINS_ADC2_PERIPHERAL                                      ADC2   /*!< Peripheral name */
#define BOARD_INITPINS_ADC2_SIGNAL                                            IN   /*!< Signal name */
#define BOARD_INITPINS_ADC2_CHANNEL                                          12U   /*!< Signal channel */

/* GPIO_AD_B0_14 (coord H14), MCU_PD_TEST_TRIGGER */
/* Routed pin properties */
#define BOARD_INITPINS_MCU_PD_TEST_TRIGGER_PERIPHERAL                      GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_MCU_PD_TEST_TRIGGER_SIGNAL                        gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MCU_PD_TEST_TRIGGER_CHANNEL                           14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MCU_PD_TEST_TRIGGER_GPIO                            GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MCU_PD_TEST_TRIGGER_GPIO_PIN                          14U   /*!< GPIO pin number */
#define BOARD_INITPINS_MCU_PD_TEST_TRIGGER_GPIO_PIN_MASK             (1U << 14U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MCU_PD_TEST_TRIGGER_PORT                            GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MCU_PD_TEST_TRIGGER_PIN                               14U   /*!< PORT pin number */
#define BOARD_INITPINS_MCU_PD_TEST_TRIGGER_PIN_MASK                  (1U << 14U)   /*!< PORT pin mask */

/* GPIO_AD_B0_15 (coord L10), MCU_LED_TEST_TRIGGER */
/* Routed pin properties */
#define BOARD_INITPINS_MCU_LED_TEST_TRIGGER_PERIPHERAL                     GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_MCU_LED_TEST_TRIGGER_SIGNAL                       gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MCU_LED_TEST_TRIGGER_CHANNEL                          15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MCU_LED_TEST_TRIGGER_GPIO                           GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MCU_LED_TEST_TRIGGER_GPIO_PIN                         15U   /*!< GPIO pin number */
#define BOARD_INITPINS_MCU_LED_TEST_TRIGGER_GPIO_PIN_MASK            (1U << 15U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MCU_LED_TEST_TRIGGER_PORT                           GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MCU_LED_TEST_TRIGGER_PIN                              15U   /*!< PORT pin number */
#define BOARD_INITPINS_MCU_LED_TEST_TRIGGER_PIN_MASK                 (1U << 15U)   /*!< PORT pin mask */

/* GPIO_AD_B1_08 (coord H13), ADC_MUX11 */
/* Routed pin properties */
#define BOARD_INITPINS_ADC_MUX11_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_ADC_MUX11_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ADC_MUX11_CHANNEL                                     19U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ADC_MUX11_GPIO                                      GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ADC_MUX11_GPIO_PIN                                    19U   /*!< GPIO pin number */
#define BOARD_INITPINS_ADC_MUX11_GPIO_PIN_MASK                       (1U << 19U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ADC_MUX11_PORT                                      GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ADC_MUX11_PIN                                         19U   /*!< PORT pin number */
#define BOARD_INITPINS_ADC_MUX11_PIN_MASK                            (1U << 19U)   /*!< PORT pin mask */

