windsinger99/wmc-ctsi-0850-fe-be-app/board/pin_mux.h
/* GPIO_AD_B1_04 (coord L12), ADD_MUX12 */
/* Routed pin properties */
#define BOARD_INITPINS_ADD_MUX12_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_ADD_MUX12_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ADD_MUX12_CHANNEL                                     20U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ADD_MUX12_GPIO                                      GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ADD_MUX12_GPIO_PIN                                    20U   /*!< GPIO pin number */
#define BOARD_INITPINS_ADD_MUX12_GPIO_PIN_MASK                       (1U << 20U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ADD_MUX12_PORT                                      GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ADD_MUX12_PIN                                         20U   /*!< PORT pin number */
#define BOARD_INITPINS_ADD_MUX12_PIN_MASK                            (1U << 20U)   /*!< PORT pin mask */

/* GPIO_AD_B1_05 (coord K12), ADD_MUX13 */
/* Routed pin properties */
#define BOARD_INITPINS_ADD_MUX13_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_ADD_MUX13_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ADD_MUX13_CHANNEL                                     21U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ADD_MUX13_GPIO                                      GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ADD_MUX13_GPIO_PIN                                    21U   /*!< GPIO pin number */
#define BOARD_INITPINS_ADD_MUX13_GPIO_PIN_MASK                       (1U << 21U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ADD_MUX13_PORT                                      GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ADD_MUX13_PIN                                         21U   /*!< PORT pin number */
#define BOARD_INITPINS_ADD_MUX13_PIN_MASK                            (1U << 21U)   /*!< PORT pin mask */



/* GPIO_AD_B1_09 (coord M13), TEST_POING_2 */
/* Routed pin properties */
#define BOARD_INITPINS_TEST_POING_2_PERIPHERAL                             GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_TEST_POING_2_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITPINS_TEST_POING_2_CHANNEL                                  25U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TEST_POING_2_GPIO                                   GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_TEST_POING_2_GPIO_PIN                                 25U   /*!< GPIO pin number */
#define BOARD_INITPINS_TEST_POING_2_GPIO_PIN_MASK                    (1U << 25U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_TEST_POING_2_PORT                                   GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_TEST_POING_2_PIN                                      25U   /*!< PORT pin number */
#define BOARD_INITPINS_TEST_POING_2_PIN_MASK                         (1U << 25U)   /*!< PORT pin mask */

/* GPIO_AD_B1_10 (coord L13), TEST_POING_3 */
/* Routed pin properties */
#define BOARD_INITPINS_TEST_POING_3_PERIPHERAL                             GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_TEST_POING_3_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITPINS_TEST_POING_3_CHANNEL                                  26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TEST_POING_3_GPIO                                   GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_TEST_POING_3_GPIO_PIN                                 26U   /*!< GPIO pin number */
#define BOARD_INITPINS_TEST_POING_3_GPIO_PIN_MASK                    (1U << 26U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_TEST_POING_3_PORT                                   GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_TEST_POING_3_PIN                                      26U   /*!< PORT pin number */
#define BOARD_INITPINS_TEST_POING_3_PIN_MASK                         (1U << 26U)   /*!< PORT pin mask */

/* GPIO_AD_B1_11 (coord J13), MCU_LED_HGROUP_DATA */
/* Routed pin properties */
#define BOARD_INITPINS_MCU_LED_HGROUP_DATA_PERIPHERAL                      GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_MCU_LED_HGROUP_DATA_SIGNAL                        gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MCU_LED_HGROUP_DATA_CHANNEL                           27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MCU_LED_HGROUP_DATA_GPIO                            GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MCU_LED_HGROUP_DATA_GPIO_PIN                          27U   /*!< GPIO pin number */
#define BOARD_INITPINS_MCU_LED_HGROUP_DATA_GPIO_PIN_MASK             (1U << 27U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MCU_LED_HGROUP_DATA_PORT                            GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MCU_LED_HGROUP_DATA_PIN                               27U   /*!< PORT pin number */
#define BOARD_INITPINS_MCU_LED_HGROUP_DATA_PIN_MASK                  (1U << 27U)   /*!< PORT pin mask */

/* GPIO_AD_B1_14 (coord G12), MCU_ADC_GROUP_SELECT_0 */
/* Routed pin properties */
#define BOARD_INITPINS_MCU_ADC_GROUP_SELECT_0_PERIPHERAL                   GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_MCU_ADC_GROUP_SELECT_0_SIGNAL                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MCU_ADC_GROUP_SELECT_0_CHANNEL                        30U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MCU_ADC_GROUP_SELECT_0_GPIO                         GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MCU_ADC_GROUP_SELECT_0_GPIO_PIN                       30U   /*!< GPIO pin number */
#define BOARD_INITPINS_MCU_ADC_GROUP_SELECT_0_GPIO_PIN_MASK          (1U << 30U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MCU_ADC_GROUP_SELECT_0_PORT                         GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MCU_ADC_GROUP_SELECT_0_PIN                            30U   /*!< PORT pin number */
#define BOARD_INITPINS_MCU_ADC_GROUP_SELECT_0_PIN_MASK               (1U << 30U)   /*!< PORT pin mask */

