windsinger99/wmc-ctsi-0850-fe-be-app/board/pin_mux.h
/* GPIO_AD_B1_15 (coord J14), MCU_ADC_GROUP_SELECT_1 */
/* Routed pin properties */
#define BOARD_INITPINS_MCU_ADC_GROUP_SELECT_1_PERIPHERAL                   GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_MCU_ADC_GROUP_SELECT_1_SIGNAL                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MCU_ADC_GROUP_SELECT_1_CHANNEL                        31U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MCU_ADC_GROUP_SELECT_1_GPIO                         GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MCU_ADC_GROUP_SELECT_1_GPIO_PIN                       31U   /*!< GPIO pin number */
#define BOARD_INITPINS_MCU_ADC_GROUP_SELECT_1_GPIO_PIN_MASK          (1U << 31U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MCU_ADC_GROUP_SELECT_1_PORT                         GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MCU_ADC_GROUP_SELECT_1_PIN                            31U   /*!< PORT pin number */
#define BOARD_INITPINS_MCU_ADC_GROUP_SELECT_1_PIN_MASK               (1U << 31U)   /*!< PORT pin mask */

/* GPIO_B0_01 (coord E7), MCU_LED_CELL_CTRL1 */
/* Routed pin properties */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL1_PERIPHERAL                       GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL1_SIGNAL                         gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL1_CHANNEL                             1U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL1_GPIO                             GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL1_GPIO_PIN                            1U   /*!< GPIO pin number */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL1_GPIO_PIN_MASK               (1U << 1U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL1_PORT                             GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL1_PIN                                 1U   /*!< PORT pin number */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL1_PIN_MASK                    (1U << 1U)   /*!< PORT pin mask */

/* GPIO_B0_02 (coord E8), MCU_LED_CELL_CTRL2 */
/* Routed pin properties */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL2_PERIPHERAL                       GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL2_SIGNAL                         gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL2_CHANNEL                             2U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL2_GPIO                             GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL2_GPIO_PIN                            2U   /*!< GPIO pin number */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL2_GPIO_PIN_MASK               (1U << 2U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL2_PORT                             GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL2_PIN                                 2U   /*!< PORT pin number */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL2_PIN_MASK                    (1U << 2U)   /*!< PORT pin mask */

/* GPIO_B0_03 (coord D8), MCU_LED_CELL_CTRL3 */
/* Routed pin properties */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL3_PERIPHERAL                       GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL3_SIGNAL                         gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL3_CHANNEL                             3U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL3_GPIO                             GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL3_GPIO_PIN                            3U   /*!< GPIO pin number */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL3_GPIO_PIN_MASK               (1U << 3U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL3_PORT                             GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL3_PIN                                 3U   /*!< PORT pin number */
#define BOARD_INITPINS_MCU_LED_CELL_CTRL3_PIN_MASK                    (1U << 3U)   /*!< PORT pin mask */

/* GPIO_B1_00 (coord A11), MCU_SINK_DAC_0 */
/* Routed pin properties */
#define BOARD_INITPINS_MCU_SINK_DAC_0_PERIPHERAL                           GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_MCU_SINK_DAC_0_SIGNAL                             gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MCU_SINK_DAC_0_CHANNEL                                16U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MCU_SINK_DAC_0_GPIO                                 GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MCU_SINK_DAC_0_GPIO_PIN                               16U   /*!< GPIO pin number */
#define BOARD_INITPINS_MCU_SINK_DAC_0_GPIO_PIN_MASK                  (1U << 16U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MCU_SINK_DAC_0_PORT                                 GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MCU_SINK_DAC_0_PIN                                    16U   /*!< PORT pin number */
#define BOARD_INITPINS_MCU_SINK_DAC_0_PIN_MASK                       (1U << 16U)   /*!< PORT pin mask */

/* GPIO_B1_01 (coord B11), MCU_SINK_DAC_1 */
/* Routed pin properties */
#define BOARD_INITPINS_MCU_SINK_DAC_1_PERIPHERAL                           GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_MCU_SINK_DAC_1_SIGNAL                             gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MCU_SINK_DAC_1_CHANNEL                                17U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MCU_SINK_DAC_1_GPIO                                 GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MCU_SINK_DAC_1_GPIO_PIN                               17U   /*!< GPIO pin number */
#define BOARD_INITPINS_MCU_SINK_DAC_1_GPIO_PIN_MASK                  (1U << 17U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MCU_SINK_DAC_1_PORT                                 GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MCU_SINK_DAC_1_PIN                                    17U   /*!< PORT pin number */
#define BOARD_INITPINS_MCU_SINK_DAC_1_PIN_MASK                       (1U << 17U)   /*!< PORT pin mask */

