windsinger99/wmc-ctsi-0850-fe-be-app/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MCU_PD_SHIFT_CLK_GPIO                               GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MCU_PD_SHIFT_CLK_GPIO_PIN                             24U   /*!< GPIO pin number */
#define BOARD_INITPINS_MCU_PD_SHIFT_CLK_GPIO_PIN_MASK                (1U << 24U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MCU_PD_SHIFT_CLK_PORT                               GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MCU_PD_SHIFT_CLK_PIN                                  24U   /*!< PORT pin number */
#define BOARD_INITPINS_MCU_PD_SHIFT_CLK_PIN_MASK                     (1U << 24U)   /*!< PORT pin mask */

/* GPIO_B1_10 (coord B13), MCU_LED_GROUP_EN */
/* Routed pin properties */
#define BOARD_INITPINS_MCU_LED_GROUP_EN_PERIPHERAL                         GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_MCU_LED_GROUP_EN_SIGNAL                           gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MCU_LED_GROUP_EN_CHANNEL                              26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MCU_LED_GROUP_EN_GPIO                               GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MCU_LED_GROUP_EN_GPIO_PIN                             26U   /*!< GPIO pin number */
#define BOARD_INITPINS_MCU_LED_GROUP_EN_GPIO_PIN_MASK                (1U << 26U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MCU_LED_GROUP_EN_PORT                               GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MCU_LED_GROUP_EN_PIN                                  26U   /*!< PORT pin number */
#define BOARD_INITPINS_MCU_LED_GROUP_EN_PIN_MASK                     (1U << 26U)   /*!< PORT pin mask */

/* GPIO_B1_14 (coord C14), MCU_PD_SHIFT_DATA */
/* Routed pin properties */
#define BOARD_INITPINS_MCU_PD_SHIFT_DATA_PERIPHERAL                        GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_MCU_PD_SHIFT_DATA_SIGNAL                          gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MCU_PD_SHIFT_DATA_CHANNEL                             30U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MCU_PD_SHIFT_DATA_GPIO                              GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MCU_PD_SHIFT_DATA_GPIO_PIN                            30U   /*!< GPIO pin number */
#define BOARD_INITPINS_MCU_PD_SHIFT_DATA_GPIO_PIN_MASK               (1U << 30U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MCU_PD_SHIFT_DATA_PORT                              GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MCU_PD_SHIFT_DATA_PIN                                 30U   /*!< PORT pin number */
#define BOARD_INITPINS_MCU_PD_SHIFT_DATA_PIN_MASK                    (1U << 30U)   /*!< PORT pin mask */

#else
#define BOARD_INITPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0xC839C000U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */
#define BOARD_INITPINS_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0x4FFF0007U /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */

/* GPIO_B1_13 (coord D14), WDOG_B */
/* Routed pin properties */
#define BOARD_INITPINS_WDOG_B_PERIPHERAL                                   WDOG1   /*!< Peripheral name */
#define BOARD_INITPINS_WDOG_B_SIGNAL                                      wdog_b   /*!< Signal name */

/* GPIO_AD_B1_06 (coord J12), [J12] GPIO_AD_B1_06_ADC1 */
/* Routed pin properties */
#define BOARD_INITPINS_ADC1_PERIPHERAL                                      ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_ADC1_SIGNAL                                            IN   /*!< Signal name */
#define BOARD_INITPINS_ADC1_CHANNEL                                          11U   /*!< Signal channel */

/* GPIO_AD_B1_07 (coord K10), [K10] GPIO_AD_B1_07_ADC2 */
/* Routed pin properties */
#define BOARD_INITPINS_ADC2_PERIPHERAL                                      ADC2   /*!< Peripheral name */
#define BOARD_INITPINS_ADC2_SIGNAL                                            IN   /*!< Signal name */
#define BOARD_INITPINS_ADC2_CHANNEL                                          12U   /*!< Signal channel */

/* GPIO_AD_B0_14 (coord H14), MCU_PD_TEST_TRIGGER */
/* Routed pin properties */
#define BOARD_INITPINS_DEBUG_TP1_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_DEBUG_TP1_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DEBUG_TP1_CHANNEL                                     14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DEBUG_TP1_GPIO                                      GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DEBUG_TP1_GPIO_PIN                                    14U   /*!< GPIO pin number */
#define BOARD_INITPINS_DEBUG_TP1_GPIO_PIN_MASK                       (1U << 14U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DEBUG_TP1_PORT                                      GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DEBUG_TP1_PIN                                         14U   /*!< PORT pin number */
#define BOARD_INITPINS_DEBUG_TP1_PIN_MASK                            (1U << 14U)   /*!< PORT pin mask */

/* GPIO_AD_B0_15 (coord L10), MCU_LED_TEST_TRIGGER */
/* Routed pin properties */
#define BOARD_INITPINS_DEBUG_TP2_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_DEBUG_TP2_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DEBUG_TP2_CHANNEL                                     15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DEBUG_TP2_GPIO                                      GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DEBUG_TP2_GPIO_PIN                                    15U   /*!< GPIO pin number */
#define BOARD_INITPINS_DEBUG_TP2_GPIO_PIN_MASK                       (1U << 15U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DEBUG_TP2_PORT                                      GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DEBUG_TP2_PIN                                         15U   /*!< PORT pin number */
#define BOARD_INITPINS_DEBUG_TP2_PIN_MASK                            (1U << 15U)   /*!< PORT pin mask */

/* GPIO_AD_B1_00 (coord J11), MCU_AN_SW_EN1 */
/* Routed pin properties */
#define BOARD_INITPINS_AN_SW_EN1_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_AN_SW_EN1_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_AN_SW_EN1_CHANNEL                                     16U   /*!< Signal channel */

