windsinger99/wmc-ctsi-0850-fe-be-app/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_AN_SW_EN1_GPIO                                      GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_AN_SW_EN1_GPIO_PIN                                    16U   /*!< GPIO pin number */
#define BOARD_INITPINS_AN_SW_EN1_GPIO_PIN_MASK                       (1U << 16U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_AN_SW_EN1_PORT                                      GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_AN_SW_EN1_PIN                                         16U   /*!< PORT pin number */
#define BOARD_INITPINS_AN_SW_EN1_PIN_MASK                            (1U << 16U)   /*!< PORT pin mask */

/* GPIO_AD_B1_03 (coord M12), ADD_MUX11 */
/* Routed pin properties */
#define BOARD_INITPINS_ADD_MUX11_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_ADD_MUX11_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ADD_MUX11_CHANNEL                                     19U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ADD_MUX11_GPIO                                      GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ADD_MUX11_GPIO_PIN                                    19U   /*!< GPIO pin number */
#define BOARD_INITPINS_ADD_MUX11_GPIO_PIN_MASK                       (1U << 19U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ADD_MUX11_PORT                                      GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ADD_MUX11_PIN                                         19U   /*!< PORT pin number */
#define BOARD_INITPINS_ADD_MUX11_PIN_MASK                            (1U << 19U)   /*!< PORT pin mask */

/* GPIO_AD_B1_04 (coord L12), ADD_MUX12 */
/* Routed pin properties */
#define BOARD_INITPINS_ADD_MUX12_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_ADD_MUX12_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ADD_MUX12_CHANNEL                                     20U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ADD_MUX12_GPIO                                      GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ADD_MUX12_GPIO_PIN                                    20U   /*!< GPIO pin number */
#define BOARD_INITPINS_ADD_MUX12_GPIO_PIN_MASK                       (1U << 20U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ADD_MUX12_PORT                                      GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ADD_MUX12_PIN                                         20U   /*!< PORT pin number */
#define BOARD_INITPINS_ADD_MUX12_PIN_MASK                            (1U << 20U)   /*!< PORT pin mask */

/* GPIO_AD_B1_05 (coord K12), ADD_MUX13 */
/* Routed pin properties */
#define BOARD_INITPINS_ADD_MUX13_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_ADD_MUX13_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ADD_MUX13_CHANNEL                                     21U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ADD_MUX13_GPIO                                      GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ADD_MUX13_GPIO_PIN                                    21U   /*!< GPIO pin number */
#define BOARD_INITPINS_ADD_MUX13_GPIO_PIN_MASK                       (1U << 21U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ADD_MUX13_PORT                                      GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ADD_MUX13_PIN                                         21U   /*!< PORT pin number */
#define BOARD_INITPINS_ADD_MUX13_PIN_MASK                            (1U << 21U)   /*!< PORT pin mask */

/* GPIO_AD_B1_11 (coord J13), MCU_LED_HGROUP_DATA */
/* Routed pin properties */
#define BOARD_INITPINS_LED_HGROUP_DATA_PERIPHERAL                          GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_LED_HGROUP_DATA_SIGNAL                            gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LED_HGROUP_DATA_CHANNEL                               27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_HGROUP_DATA_GPIO                                GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_HGROUP_DATA_GPIO_PIN                              27U   /*!< GPIO pin number */
#define BOARD_INITPINS_LED_HGROUP_DATA_GPIO_PIN_MASK                 (1U << 27U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_LED_HGROUP_DATA_PORT                                GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_LED_HGROUP_DATA_PIN                                   27U   /*!< PORT pin number */
#define BOARD_INITPINS_LED_HGROUP_DATA_PIN_MASK                      (1U << 27U)   /*!< PORT pin mask */

/* GPIO_AD_B1_14 (coord G12), MCU_ADC_GROUP_SELECT_0 */
/* Routed pin properties */
#define BOARD_INITPINS_ADC_GROUP_SELECT_0_PERIPHERAL                       GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_ADC_GROUP_SELECT_0_SIGNAL                         gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ADC_GROUP_SELECT_0_CHANNEL                            30U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ADC_GROUP_SELECT_0_GPIO                             GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ADC_GROUP_SELECT_0_GPIO_PIN                           30U   /*!< GPIO pin number */
#define BOARD_INITPINS_ADC_GROUP_SELECT_0_GPIO_PIN_MASK              (1U << 30U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ADC_GROUP_SELECT_0_PORT                             GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ADC_GROUP_SELECT_0_PIN                                30U   /*!< PORT pin number */
#define BOARD_INITPINS_ADC_GROUP_SELECT_0_PIN_MASK                   (1U << 30U)   /*!< PORT pin mask */

