windsinger99/wmc-ctsi-0850-fe-be-app/board/pin_mux.h
/* GPIO_B1_08 (coord A12), MCU_LED_CELL_EN */
/* Routed pin properties */
#define BOARD_INITPINS_LED_CELL_EN_PERIPHERAL                              GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_LED_CELL_EN_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LED_CELL_EN_CHANNEL                                   24U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_CELL_EN_GPIO                                    GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_CELL_EN_GPIO_PIN                                  24U   /*!< GPIO pin number */
#define BOARD_INITPINS_LED_CELL_EN_GPIO_PIN_MASK                     (1U << 24U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_LED_CELL_EN_PORT                                    GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_LED_CELL_EN_PIN                                       24U   /*!< PORT pin number */
#define BOARD_INITPINS_LED_CELL_EN_PIN_MASK                          (1U << 24U)   /*!< PORT pin mask */

/* GPIO_B1_09 (coord A13), MCU_LED_GROUP_CLK */
/* Routed pin properties */
#define BOARD_INITPINS_LED_GROUP_CLK_PERIPHERAL                            GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_LED_GROUP_CLK_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LED_GROUP_CLK_CHANNEL                                 25U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_GROUP_CLK_GPIO                                  GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_GROUP_CLK_GPIO_PIN                                25U   /*!< GPIO pin number */
#define BOARD_INITPINS_LED_GROUP_CLK_GPIO_PIN_MASK                   (1U << 25U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_LED_GROUP_CLK_PORT                                  GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_LED_GROUP_CLK_PIN                                     25U   /*!< PORT pin number */
#define BOARD_INITPINS_LED_GROUP_CLK_PIN_MASK                        (1U << 25U)   /*!< PORT pin mask */

/* GPIO_B1_10 (coord B13), MCU_LED_GROUP_EN */
/* Routed pin properties */
#define BOARD_INITPINS_LED_GROUP_EN_PERIPHERAL                             GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_LED_GROUP_EN_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LED_GROUP_EN_CHANNEL                                  26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_GROUP_EN_GPIO                                   GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_GROUP_EN_GPIO_PIN                                 26U   /*!< GPIO pin number */
#define BOARD_INITPINS_LED_GROUP_EN_GPIO_PIN_MASK                    (1U << 26U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_LED_GROUP_EN_PORT                                   GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_LED_GROUP_EN_PIN                                      26U   /*!< PORT pin number */
#define BOARD_INITPINS_LED_GROUP_EN_PIN_MASK                         (1U << 26U)   /*!< PORT pin mask */

/* GPIO_B1_11 (coord C13), MCU_PD_SHIFT_CLK */
/* Routed pin properties */
#define BOARD_INITPINS_PD_SHIFT_CLK_PERIPHERAL                             GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_PD_SHIFT_CLK_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITPINS_PD_SHIFT_CLK_CHANNEL                                  27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PD_SHIFT_CLK_GPIO                                   GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_PD_SHIFT_CLK_GPIO_PIN                                 27U   /*!< GPIO pin number */
#define BOARD_INITPINS_PD_SHIFT_CLK_GPIO_PIN_MASK                    (1U << 27U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_PD_SHIFT_CLK_PORT                                   GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_PD_SHIFT_CLK_PIN                                      27U   /*!< PORT pin number */
#define BOARD_INITPINS_PD_SHIFT_CLK_PIN_MASK                         (1U << 27U)   /*!< PORT pin mask */

/* GPIO_B1_14 (coord C14), MCU_PD_SHIFT_DATA */
/* Routed pin properties */
#define BOARD_INITPINS_PD_SHIFT_DATA_PERIPHERAL                            GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_PD_SHIFT_DATA_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_PD_SHIFT_DATA_CHANNEL                                 30U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PD_SHIFT_DATA_GPIO                                  GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_PD_SHIFT_DATA_GPIO_PIN                                30U   /*!< GPIO pin number */
#define BOARD_INITPINS_PD_SHIFT_DATA_GPIO_PIN_MASK                   (1U << 30U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_PD_SHIFT_DATA_PORT                                  GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_PD_SHIFT_DATA_PIN                                     30U   /*!< PORT pin number */
#define BOARD_INITPINS_PD_SHIFT_DATA_PIN_MASK
#endif
/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */

#endif
void BOARD_InitPins(void);

/* GPIO_AD_B0_12 (coord K14), UART1_TXD */
/* Routed pin properties */
#define BOARD_INITDEBUG_UART_UART1_TXD_PERIPHERAL                        LPUART1   /*!< Peripheral name */
#define BOARD_INITDEBUG_UART_UART1_TXD_SIGNAL                                 TX   /*!< Signal name */

/* GPIO_AD_B0_13 (coord L14), UART1_RXD */
/* Routed pin properties */
#define BOARD_INITDEBUG_UART_UART1_RXD_PERIPHERAL                        LPUART1   /*!< Peripheral name */
#define BOARD_INITDEBUG_UART_UART1_RXD_SIGNAL                                 RX   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UART(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDRAM(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCSI(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLCD(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCAN(void);

/* GPIO_EMC_40 (coord A7), ENET_MDC */
/* Routed pin properties */
#define BOARD_INITENET_ENET_MDC_PERIPHERAL                                  ENET   /*!< Peripheral name */
#define BOARD_INITENET_ENET_MDC_SIGNAL                                  enet_mdc   /*!< Signal name */

/* GPIO_EMC_41 (coord C7), ENET_MDIO */
/* Routed pin properties */
#define BOARD_INITENET_ENET_MDIO_PERIPHERAL                                 ENET   /*!< Peripheral name */
#define BOARD_INITENET_ENET_MDIO_SIGNAL                                enet_mdio   /*!< Signal name */

/* GPIO_B1_10 (coord B13), MCU_LED_GROUP_EN */
/* Routed pin properties */
#define BOARD_INITENET_ENET_TX_CLK_PERIPHERAL                               ENET   /*!< Peripheral name */
#define BOARD_INITENET_ENET_TX_CLK_SIGNAL                           enet_ref_clk   /*!< Signal name */

/* GPIO_B1_04 (coord E12), MCU_SINK_DAC_4 */
/* Routed pin properties */
#define BOARD_INITENET_ENET_RXD0_PERIPHERAL                                 ENET   /*!< Peripheral name */
#define BOARD_INITENET_ENET_RXD0_SIGNAL                             enet_rx_data   /*!< Signal name */
#define BOARD_INITENET_ENET_RXD0_CHANNEL                                      0U   /*!< Signal channel */

/* GPIO_B1_05 (coord D12), MCU_SINK_DAC_5 */
/* Routed pin properties */
#define BOARD_INITENET_ENET_RXD1_PERIPHERAL                                 ENET   /*!< Peripheral name */
#define BOARD_INITENET_ENET_RXD1_SIGNAL                             enet_rx_data   /*!< Signal name */
#define BOARD_INITENET_ENET_RXD1_CHANNEL                                      1U   /*!< Signal channel */

/* GPIO_B1_06 (coord C12), MCU_SINK_DAC_6 */
/* Routed pin properties */
#define BOARD_INITENET_ENET_CRS_DV_PERIPHERAL                               ENET   /*!< Peripheral name */
#define BOARD_INITENET_ENET_CRS_DV_SIGNAL                             enet_rx_en   /*!< Signal name */

/* GPIO_B1_11 (coord C13), MCU_PD_SHIFT_CLK */
/* Routed pin properties */
#define BOARD_INITENET_ENET_RXER_PERIPHERAL                                 ENET   /*!< Peripheral name */
#define BOARD_INITENET_ENET_RXER_SIGNAL                               enet_rx_er   /*!< Signal name */

/* GPIO_B1_07 (coord B12), MCU_SINK_DAC_7 */
/* Routed pin properties */
#define BOARD_INITENET_ENET_TXD0_PERIPHERAL                                 ENET   /*!< Peripheral name */
#define BOARD_INITENET_ENET_TXD0_SIGNAL                             enet_tx_data   /*!< Signal name */
#define BOARD_INITENET_ENET_TXD0_CHANNEL                                      0U   /*!< Signal channel */

